In [1]:
import pandas as pd

In [2]:
df= pd.read_csv('sample_data.csv')

In [3]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer      NaN       Masters

In [4]:
df.shape

(9, 4)

In [5]:
df.size

36

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9 entries, 0 to 8
Data columns (total 4 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Serial Number  9 non-null      int64
 1   Title          9 non-null      object
 2   Salary         8 non-null      float64
 3   Qualification  8 non-null      object
dtypes: float64(1), int64(1), object(2)
memory usage: 420.0+ bytes

In [7]:
df.columns

Index(['Serial Number', 'Title', 'Salary', 'Qualification'], dtype='object')

In [8]:
df.isnull().sum()

Serial Number    0
Title            0
Salary           1
Qualification    1
dtype: int64

In [9]:
## drop the rows
df.dropna()

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
7              8            UX/UI Developer     23.0     Bachelors

In [10]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer      NaN       Masters

In [11]:
df['Salary']= df['Salary'].fillna(1000)

In [12]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer   1000.0       Masters

In [13]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer   1000.0       Masters

In [14]:
df['Salary'].mean()

15669.222222222223

In [15]:
df['Salary']= df['Salary'].fillna(df['Salary'].mean())

In [16]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer   1000.0       Masters

In [17]:
df['Salary']= df['Salary'].fillna(df['Salary'].median())

In [18]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0           NaN
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer   1000.0       Masters

In [19]:
df['Qualification'].mode()

0    Bachelors
1      Masters
Name: Qualification, dtype: object

In [20]:
df['Qualification']= df['Qualification'].fillna(df['Qualification'].mode()[1])

In [21]:
df

   Serial Number                      Title   Salary Qualification
0              1          Software Engineer  20000.0     Bachelors
1              2             Data Scientist  23000.0       Masters
2              3            Project Manager  18000.0       Masters
3              4                  Professor  25000.0     Bachelors
4              5         Database Architect  17000.0     Bachelors
5              6  Machine Learning Engineer  19000.0       Masters
6              7           Business Analyst  18000.0       Masters
7              8            UX/UI Developer     23.0     Bachelors
8              9            Devops Engineer   1000.0       Masters

In [22]:
df.duplicated()

0    False
1    False
2    False
3    False
4    False
5    False
6    False
7    False
8    False
dtype: bool

In [23]:
df1= pd.read_csv('sample_data1.csv')

In [24]:
df[df1.duplicated()]

   Serial Number                      Title   Salary Qualification
5              6  Machine Learning Engineer  19000.0       Masters

In [25]:
df1.duplicated()

0    False
1    False
2    False
3    False
4    False
5     True
6    False
7    False
8    False
dtype: bool